Repository: joaoadavid/RDTrackr
Catalog: RDTrackr/backend/RDTrackr-BackEnd/API/src/Shared/RDTrackR.Exceptions/ResourceMessagesException.*.resx
Languages: fr, pt_pt

# EMAIL_ALREADY_REGISTERED
source: The e-mail already registered.
fr: L'email a déjà été enregistré
pt_pt: O e-mail já foi registrado

# EMAIL_EMPTY
source: The e-mail must not be empty.
fr: Le nom ne peut pas étre vide.
pt_pt: O e-mail não pode estar vazio

# EMAIL_INVALID
source: The e-mail address is invalid.
fr: L'e adresse életronique n' est pas valide.
pt_pt: O e-mail é invalido

# NAME_EMPTY
source: The name cannot be empty.
fr: L´e nom ne peut pas étre vide.
pt_pt: O nome não pode estar vazio

# PASSWORD_EMPTY
source: The password must be longer than 6 characters.
fr: Le mot de passe doit comporter plis de 6 caractéres.
pt_pt: A senha deve ter mais de 6 caracteres

# UNKNOW_ERROR
source: Erro desconhecido.
fr: Erreur inconnue.

# EMAIL_OR_PASSWORD_INVALID
source: The e-mail or password is invalid
fr: L'e-mail ou le mot de passe ne sont pas valides.
pt_pt: O e-mail ou a senha são inválidos.

# NO_TOKEN
source: The authentication token not exists.
fr: Le jeton d'authentification n'existe pas.
pt_pt: O token de autenticação não existe.

# USER_WITHOU_PERMISSION_ACCESS_RESOURCE
source: User does not have permission to access the requested resource.
fr: L'utilisateur n'a pas l'autorisation d'accéder à la ressource demandée.
pt_pt: O usuário não tem permissão para acessar o recurso solicitado.

source: Invalid password.
fr: Mot de passe invalide.
pt_pt: Senha inválida.

# PASSWORD_DIFFERENT_CURRENT_PASSWORD
source: The new password must be different from the current password.
fr: Le mot de passe est différent du mot de passe actuel.
pt_pt: A nova senha deve ser diferente da senha atual.

# RECIPE_TITLE_EMPTY
source: The recipe title cannot be empty.
fr: Le titre de la recette ne peut pas être vide.
pt_pt: O título da receita não pode estar vazio.

source: Cooking time not supported.
fr: Temps de cuisson non pris en charge.
pt_pt: Tempo de preparo não suportado.

source: Difficulty level not supported.
fr: Niveau de difficulté non pris en charge.
pt_pt: Nível de dificuldade não suportado.

# AT_LEAST_ONE_INGREDIENT
source: The recipe must contain at least one ingredient.
fr: La recette doit contenir au moins un ingrédient.
pt_pt: A receita deve conter pelo menos um ingrediente.

# AT_LEAST_ONE_INSTRUCTION
source: The recipe must contain at least one instruction.
fr: La recette doit contenir au moins une instruction.
pt_pt: A receita deve conter pelo menos uma instrução.

source: Dish type not supported.
fr: Type de plat non pris en charge.
pt_pt: Tipo de prato não suportado.

# INGREDIENT_EMPTY
source: The ingredient name cannot be empty.
fr: Le nom de l’ingrédient ne peut pas être vide.
pt_pt: O nome do ingrediente não pode estar vazio.

# NON_NEGATIVE_OR_ZERO_INSTRUCTION_STEP
source: The instruction step number must be greater than zero.
fr: Le numéro de l’étape d’instruction doit être supérieur à zéro.
pt_pt: O número da etapa da instrução deve ser maior que zero.

# INSTRUCTION_EXCEEDS_LIMIT_CHARACTERS
source: The instruction exceeds the maximum character limit.
fr: L’instruction dépasse la limite maximale de caractères.
pt_pt: A instrução excede o limite máximo de caracteres.

# TWO_OR_MORE_INSTRUCTIONS_SAME_ORDER
source: Two or more instructions cannot have the same order.
fr: Deux instructions ou plus ne peuvent pas avoir le même ordre.
pt_pt: Duas ou mais instruções não podem ter a mesma ordem.

# INSTRUCTION_EMPTY
source: The instruction cannot be empty.
fr: L’instruction ne peut pas être vide.
pt_pt: A instrução não pode estar vazia.

source: Recipe not found.
fr: Recette non trouvée.
pt_pt: Receita não encontrada.

# INVALID_NUMBER_INGREDIENTS
source: Invalid number of ingredients. The recipe must contain between 1 and 5 ingredients.
fr: Nombre d'ingrédients invalide. La recette doit contenir entre 1 et 5 ingrédients.
pt_pt: Número inválido de ingredientes. A receita deve conter entre 1 e 5 ingredientes.

# DUPLICATED_INGREDIENTS_IN_LIST
source: Duplicated ingredients. The recipe cannot contain repeated ingredients.
fr: Ingrédients dupliqués. La recette ne peut pas contenir d'ingrédients répétés.
pt_pt: Ingredientes duplicados. A receita não pode conter ingredientes repetidos.

# INGREDIENT_NOT_FOLLOWING_PATTERN
source: Ingredient not following the pattern. Each ingredient must contain between 3 and 100 characters and must not include invalid symbols.
fr: Ingrédient non conforme. Chaque ingrédient doit contenir entre 3 et 100 caractères et ne pas inclure de symboles invalides
pt_pt: Ingrediente fora do padrão. Cada ingrediente deve conter entre 3 e 100 caracteres e não incluir símbolos inválidos.

# ONLY_IMAGES_ACCEPTED
source: Invalid file type. Only JPG and PNG image formats are accepted.
fr: Type de fichier invalide. Seules les images aux formats JPG et PNG sont acceptées.
pt_pt: Tipo de arquivo inválido. Apenas imagens nos formatos JPG e PNG são aceitas.

# CODE_INVALID
source: A valid code is required to reset your password.
fr: Un code valide est requis pour réinitialiser votre mot de passe.
pt_pt: É necessário um código válido para resetar a senha.

# USER_NOT_FOUND
source: User not found with this email.
fr: Utilisateur non trouvé avec cet email.
pt_pt: Usuário não encontrado com este e-mail.

# CODE_REQUIRED
source: The code is required.
fr: Le code est obligatoire.
pt_pt: O código é obrigatório.

# EMAIL_REQUIRED
source: Email is required.
fr: L’adresse e-mail est obligatoire.
pt_pt: O e-mail é obrigatório.

# PASSWORDS_DO_NOT_MATCH
source: The passwords do not match.
fr: Les mots de passe ne correspondent pas.
pt_pt: As senhas informadas não conferem.

# PASSWORD_MAX_LENGTH
source: The password must be at most 100 characters long.
fr: Le mot de passe doit comporter au maximum 100 caractères.
pt_pt: A senha deve ter no máximo 100 caracteres.

# PASSWORD_MIN_LENGTH
source: The password must be at least 8 characters long.
fr: Le mot de passe doit comporter au moins 8 caractères.
pt_pt: A senha deve ter no mínimo 8 caracteres.

# PASSWORD_REQUIRED
source: Password is required.
fr: Le mot de passe est obligatoire.
pt_pt: A senha é obrigatória.

# EXPIRED_SESSION
source: your session is expired.
fr: Erreur inconnue. Votre session a expiré.
pt_pt: Sua sessão está expirada.

# INVALID_SESSION
source: Invalid or expired session. Please log in again.
fr: Session invalide ou expirée. Veuillez vous reconnecter.
pt_pt: Sessão inválida ou expirada. Faça login novamente.

# PRODUCT_SKU_REQUIRED
source: The product SKU is required.
fr: O SKU do produto é obrigatório.
pt_pt: O SKU do produto é obrigatório.

# PRODUCT_NAME_REQUIRED
source: The product name is required.
fr: Le nom du produit est obligatoire.
pt_pt: O nome do produto é obrigatório.

# PRODUCT_CATEGORY_REQUIRED
source: The product category is required.
fr: La catégorie du produit est obligatoire.
pt_pt: A categoria do produto é obrigatória.

# PRODUCT_UNIT_REQUIRED
source: The unit of measure is required.
fr: L’unité de mesure est obligatoire.
pt_pt: A unidade de medida é obrigatória.

# PRODUCT_PRICE_INVALID
source: The product price must be greater than or equal to zero.
fr: Le prix du produit doit être supérieur ou égal à zéro.
pt_pt: O preço do produto deve ser maior ou igual a zero.

# PRODUCT_STOCK_INVALID
source: The initial stock cannot be negative.
fr: Le stock initial ne peut pas être négatif.
pt_pt: O estoque inicial não pode ser negativo.

# PRODUCT_REORDER_INVALID
source: The reorder point must be greater than or equal to zero.
fr: Le point de réapprovisionnement doit être supérieur ou égal à zéro.
pt_pt: O ponto de reposição deve ser maior ou igual a zero.

# PRODUCT_SKU_DUPLICATE
source: A product with this SKU already exists.
fr: already exists. Un produit avec ce code SKU existe déjà
pt_pt: Já existe um produto cadastrado com este SKU.

# PRODUCT_NOT_FOUND
source: The product was not found.
fr: Le produit est introuvable.
pt_pt: O produto não foi encontrado.

# MOVEMENT_REFERENCE_REQUIRED
source: The movement reference is required.
fr: La référence du mouvement est obligatoire.
pt_pt: A referência da movimentação é obrigatória.

# MOVEMENT_PRODUCT_REQUIRED
source: The product is required.
fr: Le produit est obligatoire.
pt_pt: O produto é obrigatório.

# MOVEMENT_WAREHOUSE_REQUIRED
source: The warehouse is required.
fr: L'entrepôt est obligatoire.
pt_pt: O depósito é obrigatório.

# MOVEMENT_TYPE_REQUIRED
source: The movement type is required.
fr: Le type de mouvement est obligatoire.
pt_pt: O tipo de movimentação é obrigatório.

# MOVEMENT_TYPE_INVALID
source: Invalid movement type.
fr: Type de mouvement invalide.
pt_pt: Tipo de movimentação inválido.

# MOVEMENT_QUANTITY_INVALID
source: Quantity must be greater than zero.
fr: La quantité doit être supérieure à zéro.
pt_pt: A quantidade deve ser maior que zero.

source: Warehouse not found.
fr: Entrepôt non trouvé.
pt_pt: Armazém não encontrado.

# WAREHOUSE_ITEMS_INVALID
source: The number of items cannot be negative.
fr: Le nombre d'articles ne peut pas être négatif.
pt_pt: A quantidade de itens não pode ser negativa.

# WAREHOUSE_CAPACITY_INVALID
source: The warehouse capacity must be greater than zero.
fr: La capacité de l'entrepôt doit être supérieure à zéro.
pt_pt: A capacidade do armazém deve ser maior que zero.

# WAREHOUSE_LOCATION_REQUIRED
source: The warehouse location is required.
fr: L'emplacement de l'entrepôt est obligatoire.
pt_pt: A localização do armazém é obrigatória.

# WAREHOUSE_NAME_REQUIRED
source: The warehouse name is required.
fr: required. Le nom de l'entrepôt est obligatoire.
pt_pt: O nome do armazém é obrigatório.

# STOCK_QUANTITY_INVALID
source: Invalid quantity of items in stock.
fr: Quantité d'articles en stock invalide.
pt_pt: Quantidade de itens em estoque inválida.

source: Supplier not found.
fr: Fournisseur introuvable
pt_pt: Fornecedor não encontrado.

source: Purchase order not found.
fr: Bon de commande introuvable.
pt_pt: Ordem de compra não encontrada.

# SUPPLIER_REQUIRED
source: Supplier is required.
fr: Le fournisseur est requis.
pt_pt: O fornecedor é obrigatório.

# PO_ITEMS_REQUIRED
source: Purchase order must contain items.
fr: Le bon de commande doit contenir des articles.
pt_pt: A ordem de compra deve possuir itens.

# PO_ITEM_PRODUCT_REQUIRED
source: Purchase order item product is required.
fr: Le produit de l’article du bon est requis.
pt_pt: O produto do item da ordem é obrigatório.

# PO_ITEM_QUANTITY_INVALID
source: Item quantity must be greater than zero.
fr: La quantité de l’article doit être supérieure à zéro.
pt_pt: A quantidade do item deve ser maior que zero.

# PO_CANNOT_EDIT_ITEMS
source: Items can only be modified while the order is in draft status.
fr: Les articles ne peuvent être modifiés que si le bon est en statut brouillon (DRAFT).
pt_pt: Itens só podem ser alterados enquanto a ordem estiver em rascunho (DRAFT).

# PO_CANNOT_DELETE_RECEIVED
source: Cannot delete a received purchase order.
fr: Impossible de supprimer un bon déjà reçu.
pt_pt: Não é possível excluir uma ordem já recebida.

# SUPPLIER_NAME_REQUIRED
source: Supplier name is required.
fr: Le nom du fournisseur est requis.
pt_pt: O nome do fornecedor é obrigatório.

# SUPPLIER_EMAIL_INVALID
source: Invalid email address.
fr: Adresse e-mail invalide.
pt_pt: E-mail inválido.

# PO_ITEM_UNITPRICE_INVALID
source: The unit price must be greater than or equal to zero.
fr: Le prix unitaire doit être supérieur ou égal à zéro.
pt_pt: O preço unitário deve ser maior ou igual a zero.

# PO_ITEM_DUPLICATED
source: The purchase order contains duplicated products.
fr: Le bon de commande contient des produits en double.
pt_pt: O pedido de compra contém produtos duplicados.

# SUPPLIER_EMAIL_DUPLICATE
source: A supplier with this email already exists.
fr: Un fournisseur avec cet e-mail existe déjà.
pt_pt: Já existe um fornecedor cadastrado com este e-mail.

# SUPPLIER_EMAIL_REQUIRED
source: Supplier email is required.
fr: L'e-mail du fournisseur est obligatoire.
pt_pt: O e-mail do fornecedor é obrigatório.v

# STOCK_INSUFFICIENT
source: Insufficient stock balance.
fr: Stock insuffisant.
pt_pt: Saldo insuficiente no estoque.

# REPLENISHMENT_ITEMS_REQUIRED
source: No items selected for replenishment.
fr: Aucun article sélectionné pour le réapprovisionnement.
pt_pt: Nenhum item selecionado para reabastecimento.

# REPLENISHMENT_QTY_INVALID
source: Quantity must be greater than zero.
fr: La quantité doit être supérieure à zéro.
pt_pt: A quantidade deve ser maior que zero.

# REPLENISHMENT_UNITPRICE_INVALID
source: Unit price must be greater than zero.
fr: Le prix unitaire doit être supérieur à zéro.
pt_pt: O preço unitário deve ser maior que zero.
